modules/super/controllers/AccountController.php

SELECT * FROM `account` WHERE `id`='2'
---
    public function actionView($id)
    {
        if (($model = Account::findOne($id)) !== null) {

SELECT * FROM `account` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Account::findOne($id)) !== null) {