controllers/LoginController.php

    public function actionIndex()
    {
        Yii::$app->user->logout();
        $message = null;
        $uid = false;
        $autologin = false;
        $token = Yii::$app->request->get("token");
        $jump = Yii::$app->request->get('jump', '/super/');
        if (Yii::$app->request->isPost) {
            $username = Yii::$app->request->post('username');
            $password = Yii::$app->request->post('password');
            $autologin = Yii::$app->request->post('autologin', 0);
            if (!$username || !$password || strlen($password) < 4) {
                $message = '用户名或密码格式不正确！';
            }
            if (!isset($message)) {
                $account = Account::find()->where(['username' => $username])->one();
---
SELECT * FROM `account` WHERE `username`='admin'